# Error: Tapping homebrew/cask is no longer typically necessary.
# tap 'homebrew/cask'
tap "homebrew/cask-fonts"
tap "nikitabobko/aerospace"

cask_args appdir: "/Applications"

# develop
brew "git"
brew "volta"
brew "tree"
cask "google-cloud-sdk"
cask "visual-studio-code"
cask "postman"
brew "git-delta"

# terminal
brew "starship"
brew "fish"
brew "fzf"
brew "fisher"
brew "peco"
brew "lazygit"
brew "tmux"
brew "codespell"
brew "neovim"
brew "zoxide"
cask "alacritty"
brew "btop"
brew "dust"
brew "yazi"
brew "tealdeer"
brew "jq"

# altnatives
brew "bat"
brew "fd"
brew "ripgrep"
brew "sd"
brew "eza"

# work
cask "zoom"
cask "slack"
cask "figma"

# general 
cask "spotify"
cask "google-chrome"
# cask "alfred"
csak "raycast"
cask "kindle"
# cask "swish"
cask "notion"
cask "bitwarden"
cask "maccy"
cask "stats"
cask "karabiner-elements"
cask "dozer"
cask "appcleaner"
cask "shottr"
cask "aerospace"

# blog
# brew "hugo"
# brew "go"

# fonts
cask "font-fira-code-nerd-font"
cask "font-monaspace-nerd-font"
# cask "font-jetbrains-mono-nerd-font"
