
tap 'homebrew/cask'
tap "homebrew/cask-fonts"

cask_args appdir: "~/Applications"

# develop
brew "git"
brew "neovim"
brew "volta"
brew "tree"
brew "google-cloud-sdk"
cask "visual-studio-code"
cask "postman"

# terminal
cask "iterm2"
brew "starship"
brew "fish"
brew "fzf"
brew "fisher"
brew "peco"


# altnatives
brew "bat"
brew "fd"
brew "ripgrep"
brew "sd"
brew "exa"

# work
cask "zoom"
cask "slack"
cask "figma"

# daily
cask "spotify"
cask "google-chrome"
cask "alfred"
cask "kindle"
cask "swish"
cask "notion"
cask "bitwarden"
brew "stats"

# blog
brew "hugo"
brew "go"

# fonts
cask "font-hack-nerd-font"
