
tap 'homebrew/cask'
tap "homebrew/cask-fonts"

cask_args appdir: "~/Applications"

# develop
brew "git"
brew "volta"
brew "tree"
cask "google-cloud-sdk"
cask "visual-studio-code"
cask "postman"
brew "git-delta"

# terminal
brew "starship"
brew "fish"
brew "fzf"
brew "fisher"
brew "peco"
brew "lazygit"
brew "tmux"
brew "codespell"
brew "neovim"
brew "lf"
brew "zoxide"
cask "iterm2"
cask "alacritty"
brew "gotop"
brew "helix"
brew "nnn"

# altnatives
brew "bat"
brew "fd"
brew "ripgrep"
brew "sd"
brew "exa"

# work
cask "zoom"
cask "slack"
cask "figma"

# general 
cask "spotify"
cask "google-chrome"
cask "alfred"
cask "kindle"
cask "swish"
cask "notion"
cask "bitwarden"
cask "maccy"
cask "stats"
cask "karabiner-elements"

# blog
brew "hugo"
brew "go"

# fonts
cask "font-fira-code-nerd-font"
